<?
require "include/bittorrent.php";
dbconn(false);
stdheadchat("Писанные правила");
global $DEFAULTBASEURL;

/*
sql_query("UPDATE torrents SET category='11' WHERE name LIKE '%[LostFilm]%' OR name LIKE '%[NovaFilm]%' OR name LIKE '%[Studdio]%' OR name LIKE '%[NewStudio]%' OR name LIKE '%[Kvadrat]%' LIMIT 10000") or sqlerr(__FILE__,__LINE__);


sql_query("UPDATE torrents SET category='11' WHERE name LIKE '%season%' AND name LIKE '%episode%' LIMIT 10000") or sqlerr(__FILE__,__LINE__);

sql_query("UPDATE torrents SET category='10' WHERE name LIKE '%[Dance]%' OR name LIKE '%[Soundtrack]%' OR name LIKE '%MP3%' OR name LIKE '%VA -%' LIMIT 10000") or sqlerr(__FILE__,__LINE__);

sql_query("UPDATE torrents SET category='8' WHERE name LIKE '%[PSP]%' OR name LIKE '%(PSP)%' OR name LIKE '%[PSX-PSP]%' LIMIT 10000") or sqlerr(__FILE__,__LINE__);

sql_query("UPDATE torrents SET category='27' WHERE name LIKE '%[iPhone%' LIMIT 10000") or sqlerr(__FILE__,__LINE__);


sql_query("UPDATE torrents SET category='12' WHERE name LIKE '%[AniDUB]%' LIMIT 10000") or sqlerr(__FILE__,__LINE__);

sql_query("UPDATE torrents SET category='25' WHERE name LIKE '%обои%' LIMIT 10000") or sqlerr(__FILE__,__LINE__);


*/



?>
<table class=main width=100% border=0 cellspacing=0 cellpadding=0><tr><td class=embedded>
<h2>Деньги для трекера (в зависимости от количества пользователей)</h2>

<table width=100% cellspacing=0 cellpadding=3><tr>
<td width=50% class=b>
<b>Рейтинг безграничный</b>: 
<li>Безграничный рейтинг на месяц: <b>5$</b></li>
<li>Безграничный рейтинг на два месяца: <b>10$</b></li>
<li>Безграничный рейтинг на четыре месяца: <b>20$</b></li>
<li>Безграничный рейтинг на шесть месяцев: <b>30$</b></li>
<li>Безграничный рейтинг на один год: <b>50$</b></li>
</td>

<td width=50% class=b>
<b>Также количество отданного (аплоада)</b>:

<li>Добавить 50 ГБ: <b>5$</b></li>
<li>Добавить 100 ГБ: <b>9$</b></li>
<li>Добавить 150 ГБ: <b>17$</b></li>

<li>Добавить 300 ГБ: <b>30$</b></li>

<li>Добавить более 300 ГБ: <b>по договоренности</b></li>

</td></tr></table>



<table width=100% cellspacing=0 cellpadding=0><tr>
<td width=50% class=b>
<b>Уникальность цвета в нике</b>: 
<li>Ваш выбранный цвет на месяц: <b>6$</b></li>
<li>Ваш выбранный цвет на два месяца: <b>10$</b></li>
<li>Ваш выбранный цвет на четыре месяца: <b>20$</b></li>
<li>Ваш выбранный цвет на один год: <b>50$</b></li>
<li>Ваш выбранный цвет на всю жизнь работы сайта: <b>80$</b></li>
<b>Пример</b>:<span style="color: red;">Мой</span><span style="color: blue;">ник</span>, <span style="color: red;">М</span><span style="color: blue;">ой</span><span style="color: green;">ник</span>, <span style="color: gray;">М</span><span style="color: blue;">о</span><span style="color: #FFA500;">й</span><span style="color: gray;">ник</span> и так далее. <br><u><b>Менять цвет разрешается лишь один два раз</b></u>!
</td>
<td width=50% class=b>

<b>Права</b>:

<li>Хочу права <span title="V.I.P." style="color: rgb(156, 47, 224);">V.I.P.</span>: <b>15-20$</b> [от месяца до 4 - 12 месяцев]</li>
<li>Хочу права <span title="Модератор" style="color: red;">Модератора</span>: <b>40-50$</b> [злоупотребление карается сменой прав]</li>
Почему так дорого? а кто знает зачем вам права модератора, вдруг ради вида или другой причины (взлом).

</td></tr></table>

<table width=100% cellspacing=0 cellpadding=0><tr>
<td align=left width=60% class=a>
Данные деньги пойдут на содержание сайта, хостинг не бесплатный и требуется каждый месяц оплачивать. Поднятие тиц и пр сайта, раскрутка в целом не дешевая.<br> <b>Оплатить данные услуги можно по адресу</b>: 
<li><b>Z408878901965</b> (webmoney долларовый кошелек) <span style="color: #FF00FF;">*</span></li>
<li><b>R41001454507641</b> (яндекс деньги) <span style="color: #FF00FF;">*</span></li>
Символ <span style="color: #FF00FF;">*</span> означает по возможности используйте эти кошельки.<br>

Пожалуйста указывайте точную причину в комментариях, за что именно хотите заплатить (логин ваш обязателен, иначе как вас найти тут). 
</td></tr></table>

</td></tr></table>


<table class=main width=100% border=0 cellspacing=0 cellpadding=0><tr><td class=embedded>
<h2>Некоторые правила этого созданного трекера</h2>
<table width=100% border=1 cellspacing=0 cellpadding=10><tr><td class=text>
							 

<table width=100% cellspacing=0 cellpadding=3><tr><td>
<b>Как я могу получить те или иные права?</b><br/>
Права Пользователя вы можете получить автоматом, сразу после регистрации своей учетной записи.<br />
Права Опытного пользователя вы можете получить от системы, когда зарегистрированны на трекере более месяца (см по настройкам нашим) и рейтинг имеете в пределах <b>одного</b> то система автоматически повышает вас, или понижает если меньше данного числа.<br />
Права Вип получают "избранные" друзья, подружки или люди которые заплатили за этот статус (что чаще).<br />
Права Аплодер, вы получаете "сами" после заполнения <a class=altlink href=uploadapp.php>специальной</a> формы связи.<br />
Права Модератор, выбирают администраторы или боссы трекера. Если они увидели в вас модератора то обязательно спросят вас, хотите ли вы помогать сайту?!...Также модератор знает:<br />
Как заливать, Как Скачивать, Как правильно выражатся (в общении и обьяснении), Как вести себя на сайте и многое другое.<br />
Права Администратор, всегда были и будут люди к которым больше доверия чем к модераторам и их выбирают в частности одни боссы.<br/>
Права Босс, выбирает трекер.<br/>
Больше прав на трекере нет.
<br/><br />

<b>Информация о заливках, релизах, файлах.</b><br />
Все файлы, которые есть на трекере - проверяются администрацией. Если файл (чаще конкретно новый)  не проверен, значить еще проверяется и через некоторое время будет готов к раздаче/скачке. Иначе собственник релиза может скачать его, но не раздавать, получит ошибку ---- Торрент еще непроверен модератором ----. Пользователи же, не найдут ссылки на скачивание релиза. (вот что значить проверка)<br />
<br />
<b>Некоторые торрент ошибки</b>:<br />
Торрент не зарегистрирован на трекере - значить файла нет на трекере (возможно удален с сервера).<br />
Торрент забанен на трекере - файл забанен администрацией, значить он "не готов к этому миру".<br />
Торрент еще непроверен модератором - файл еще не проверен администрацией, подождите немного, если не вмноготу, напишите в чате или в личку кому то чтобы проверили релиз.<br />
Неизвестный пасскей. Пожалуйста перекачайте торрент файл с <?=$DEFAULTBASEURL?> - значить что, У вас не правильный пасскей (неверен) или же вы отключенны на трекере.<br />
Нельзя скачивать торренты через браузер - смените бит-клиент программу на utorrent вместо браузера (Opera).<br />
Ваш аккаунт припаркован, см настройки в my.php - Ваша учетная запись была припаркованна, значить и вам же будет снята на <a class=altlink href=my.php>этой</a> страничке.<br />
Вам отключили скачивание торрентов! - Администрация сайта отключила вам скачивание торрент файлов.<br />
Порт xxx в черном списке. - смените порт для подключения, так как данный порт в черном списке трекера.
<br />
Ваш бит клиент не может соединится с трекером, проверьте порты. - смените порт для подключения, проверьте nat (файерфол на модеме и компьютере). Также можете обратится в техподдержку сайта.<br />

другие ошибки очень редко появляются, их описывать не будем.

<br /><br />




<b>Как работает автоочистка сайта?</b><br />
Она работает каждые 900 секунд, у нее функции:
Удаление аккаунтов старше 2x месяцев, нет входа в течении 2 месяцев значить и нет вас.<br />
Припаркованный пользователь который не входил на сайт в течении полгода, удаляется.<br />
Удаляются системные сообщения старше одной недели.<br />
Подтвержденные аккаунты удаляются по истечению двух дней, если не успели активировать по почте аккаунт значить не судьба вообще.<br />
Получили 5 предупреждений + ничего не предпринимаете в течении 900 секунд? значить система отключает вас.<br />
Если отключен аккаунт и прошло 2 месяца - бан по почте. После удаление.
<br />
и многие другие функции.<br /><br />




</td></tr></table>
</td></tr></table>
</td></tr></table>
<?
stdfootchat();
?>