<?
if (!defined('BLOCK_FILE')) {
 Header("Location: ../index.php");
 exit;
}

$content = "<font style=\"font-size: 13px;\" face=\"Palatino Linotype\">
<center><b>.</b>::<b>ѕредупреждение</b>::<b>.</b><br> [об€зательно дл€ чтени€]</center>";

$content .= "
»нформаци€, расположенна€ на данном сервере, предназначена исключительно дл€ <b>частного использовани€</b>. Ќи владелец сайта, ни хостинг-провайдер, ни любые другие лица не могут нести никакой ответственности за любое использование материалов данного сайта. ¬ход€ на сайт, ¬ы, как пользователь, тем самым подтверждаете полное и безоговорочное согласие со всеми услови€ми использовани€, а также должны прочитать правила трекера. </li>

<br>“рекер не содержит никакой нелегальной информации (если вы <u>правообладатель</u> сначала проверьте данные по поиску <a href=\"license.php\">запрещенных файлов</a>), а только <b>хешсуммы</b> файлов свободно доступных в сети. ¬ладельцы сайта не могут нести ответственности за действи€ пользователей (но властны правилам). IP адрес, порт, почта, все св€зи общени€ и другие информационные данные действуют только на данном сайте, они же <b>не разглашаютс€*</b> за пределами его. ћы не конкуренты, нам не нужно контролировать всех.

<br>Ћюбое копирование материалов с данного ресурса, разрешено только при указании ссылки на этот же сайт, иначе предупреждение вплоть до удалени€ аккаунта (посл. правило касаетс€ и до кражи исходников будут предприниматс€ жесточайщие меры). ”важайте свой (торренты) и наш (безопасность и слежение за аккаунтами и целом сайтом) труд. 
<br><br>

<center><b>—пасибо за поддержку</b></center>
</font>
"; 
//<center><b>".VERSION."</b></center> 
?>